Common checks
=====================
     
tags: regress, smoke

## Проверка отображения страницы
* Открыть сайт CSS Diner
* Проверить наличие хедера и его элементов
* Проверить наличия блока CSS Editor и его элементов
* Проверить наличия блока HTML Viewer
* Проверить наличия правого блока и его элементов
* Очистка данных браузера

## Проверка работы кнопок навигации
* Открыть сайт CSS Diner
* Проверить отображение уровня "Level 1 of 32"
* Проверить наличие задания "Select the plates"
* Нажать на кнопку навигации "NEXT"
* Проверить отображение уровня "Level 2 of 32"
* Проверить наличие задания "Select the bento boxes"
* Нажать на кнопку навигации "PREVIOUS"
* Проверить отображение уровня "Level 1 of 32"
* Проверить наличие задания "Select the plates"
* Очистка данных браузера

## Переход на произвольный уровень
* Открыть сайт CSS Diner
* Проверить отображение уровня "Level 1 of 32"
* Раскрыть сендвич-меню
* Кликнуть на уровень "12"
* Проверить отображение уровня "Level 12 of 32"
* Строка ввода: ввести текст "13"
* Нажать кнопку Enter
* Проверить отображение уровня "Level 13 of 32"