Check 1 level
=====================
     
tags: regress, 1_level

## Проверка прохождения первого уровня
* Открыть сайт CSS Diner
* Проверить наличие задания "Select the plates"
* Проверить отображение уровня "Level 1 of 32"
* Строка ввода: ввести текст "plate"
* Нажать кнопку Enter
* Проверить отображение уровня "Level 2 of 32"
* Очистка данных браузера

## Проверка отказа при неверном решении
* Открыть сайт CSS Diner
* Проверить отображение уровня "Level 1 of 32"
* Строка ввода: ввести текст "div"
* Нажать кнопку Enter
* Проверить отображение уровня "Level 1 of 32"
* Очистка данных браузера
